## [Terraform Plan Summary]
| 항목            | 값 |
|-----------------|-----|
| **Status**      | `success` |
| **Directory**   | `dev-team-account/state/S3`  |
| **Executed At** | `2025-07-28 06:05:04 UTC` |

---

### Plan Output
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_kms_key.s3_key will be destroyed
  # (because aws_kms_key.s3_key is not in configuration)
  - resource "aws_kms_key" "s3_key" {
      - arn                                = "arn:aws:kms:ap-northeast-2:926943999891:key/07eb38dc-876f-4e2e-aa3f-5696eb002c4e" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - description                        = "KMS key for S3 encryption" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "07eb38dc-876f-4e2e-aa3f-5696eb002c4e" -> null
      - is_enabled                         = true -> null
      - key_id                             = "07eb38dc-876f-4e2e-aa3f-5696eb002c4e" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::926943999891:root"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowRootAccountFullAccess"
                    },
                  - {
                      - Action    = [
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:DescribeKey",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "926943999891"
                              - "aws:SourceArn"     = "arn:aws:s3:::cloudfence-dev-state"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "s3.amazonaws.com"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowS3ServicePrincipal"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                             = "ap-northeast-2" -> null
      - rotation_period_in_days            = 365 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
    }

  # aws_s3_bucket_server_side_encryption_configuration.encryption will be updated in-place
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {
        id     = "cloudfence-dev-state"
        # (2 unchanged attributes hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn:aws:kms:ap-northeast-2:926943999891:key/07eb38dc-876f-4e2e-aa3f-5696eb002c4e" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_kms.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for S3 encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::926943999891:root"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowRootAccountFullAccess"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "926943999891"
                              + "aws:SourceArn"     = "arn:aws:s3:::cloudfence-dev-state"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowS3ServicePrincipal"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

### Plan Error (if any)
```

```